---
kind: method
id: M:Autodesk.Revit.DB.ExternalDefinition.GetGroupTypeId
source: html/4c626022-501b-c2e4-7182-de22797aa61c.htm
---
# Autodesk.Revit.DB.ExternalDefinition.GetGroupTypeId Method

Returns the identifier of the parameter definition's parameter group.

## Syntax (C#)
```csharp
public override ForgeTypeId GetGroupTypeId()
```